test_results/benchmarks/coroutine_perf_20260314_001228.txt
=== SET Operations ===
====== SET ======
  10000 requests completed in 11.39 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 4.487 milliseconds (cumulative count 1)
50.000% <= 11.519 milliseconds (cumulative count 5000)
75.000% <= 12.263 milliseconds (cumulative count 7515)
87.500% <= 12.767 milliseconds (cumulative count 8758)
93.750% <= 13.183 milliseconds (cumulative count 9375)
96.875% <= 13.503 milliseconds (cumulative count 9690)
98.438% <= 13.935 milliseconds (cumulative count 9844)
99.219% <= 14.159 milliseconds (cumulative count 9923)
99.609% <= 15.023 milliseconds (cumulative count 9961)
99.805% <= 18.175 milliseconds (cumulative count 9984)
99.902% <= 27.775 milliseconds (cumulative count 9991)
99.951% <= 31.567 milliseconds (cumulative count 9996)
99.976% <= 33.151 milliseconds (cumulative count 9998)
99.988% <= 33.727 milliseconds (cumulative count 9999)
99.994% <= 34.559 milliseconds (cumulative count 10000)
100.000% <= 34.559 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.130% <= 5.103 milliseconds (cumulative count 13)
0.420% <= 6.103 milliseconds (cumulative count 42)
0.920% <= 7.103 milliseconds (cumulative count 92)
2.690% <= 8.103 milliseconds (cumulative count 269)
6.600% <= 9.103 milliseconds (cumulative count 660)
16.440% <= 10.103 milliseconds (cumulative count 1644)
38.230% <= 11.103 milliseconds (cumulative count 3823)
70.750% <= 12.103 milliseconds (cumulative count 7075)
92.610% <= 13.103 milliseconds (cumulative count 9261)
98.930% <= 14.103 milliseconds (cumulative count 9893)
99.610% <= 15.103 milliseconds (cumulative count 9961)
99.800% <= 16.103 milliseconds (cumulative count 9980)
99.900% <= 19.103 milliseconds (cumulative count 9990)
99.910% <= 28.111 milliseconds (cumulative count 9991)
99.920% <= 29.103 milliseconds (cumulative count 9992)
99.940% <= 30.111 milliseconds (cumulative count 9994)
99.950% <= 31.103 milliseconds (cumulative count 9995)
99.960% <= 32.111 milliseconds (cumulative count 9996)
99.970% <= 33.119 milliseconds (cumulative count 9997)
99.990% <= 34.111 milliseconds (cumulative count 9999)
100.000% <= 35.103 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 877.65 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       11.349     4.480    11.519    13.319    14.127    34.559

=== GET Operations ===
====== GET ======
  10000 requests completed in 11.74 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 4.567 milliseconds (cumulative count 1)
50.000% <= 11.655 milliseconds (cumulative count 5006)
75.000% <= 12.671 milliseconds (cumulative count 7510)
87.500% <= 13.327 milliseconds (cumulative count 8768)
93.750% <= 13.743 milliseconds (cumulative count 9377)
96.875% <= 14.135 milliseconds (cumulative count 9688)
98.438% <= 14.583 milliseconds (cumulative count 9844)
99.219% <= 15.383 milliseconds (cumulative count 9924)
99.609% <= 19.343 milliseconds (cumulative count 9961)
99.805% <= 27.327 milliseconds (cumulative count 9981)
99.902% <= 32.047 milliseconds (cumulative count 9995)
99.951% <= 32.063 milliseconds (cumulative count 9997)
99.976% <= 32.863 milliseconds (cumulative count 9998)
99.988% <= 33.663 milliseconds (cumulative count 9999)
99.994% <= 34.751 milliseconds (cumulative count 10000)
100.000% <= 34.751 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.120% <= 5.103 milliseconds (cumulative count 12)
0.430% <= 6.103 milliseconds (cumulative count 43)
0.800% <= 7.103 milliseconds (cumulative count 80)
1.720% <= 8.103 milliseconds (cumulative count 172)
4.580% <= 9.103 milliseconds (cumulative count 458)
13.390% <= 10.103 milliseconds (cumulative count 1339)
34.090% <= 11.103 milliseconds (cumulative count 3409)
62.100% <= 12.103 milliseconds (cumulative count 6210)
83.310% <= 13.103 milliseconds (cumulative count 8331)
96.770% <= 14.103 milliseconds (cumulative count 9677)
99.190% <= 15.103 milliseconds (cumulative count 9919)
99.390% <= 16.103 milliseconds (cumulative count 9939)
99.400% <= 17.103 milliseconds (cumulative count 9940)
99.510% <= 19.103 milliseconds (cumulative count 9951)
99.800% <= 20.111 milliseconds (cumulative count 9980)
99.820% <= 28.111 milliseconds (cumulative count 9982)
99.830% <= 29.103 milliseconds (cumulative count 9983)
99.840% <= 30.111 milliseconds (cumulative count 9984)
99.860% <= 31.103 milliseconds (cumulative count 9986)
99.970% <= 32.111 milliseconds (cumulative count 9997)
99.980% <= 33.119 milliseconds (cumulative count 9998)
99.990% <= 34.111 milliseconds (cumulative count 9999)
100.000% <= 35.103 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 852.01 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       11.689     4.560    11.655    13.855    14.967    34.751

=== Mixed Operations ===
====== SET ======
  10000 requests completed in 11.14 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 3.911 milliseconds (cumulative count 1)
50.000% <= 11.167 milliseconds (cumulative count 5019)
75.000% <= 11.983 milliseconds (cumulative count 7524)
87.500% <= 12.471 milliseconds (cumulative count 8759)
93.750% <= 12.919 milliseconds (cumulative count 9375)
96.875% <= 13.271 milliseconds (cumulative count 9700)
98.438% <= 13.607 milliseconds (cumulative count 9847)
99.219% <= 14.231 milliseconds (cumulative count 9922)
99.609% <= 14.631 milliseconds (cumulative count 9961)
99.805% <= 19.423 milliseconds (cumulative count 9985)
99.902% <= 26.143 milliseconds (cumulative count 9991)
99.951% <= 30.399 milliseconds (cumulative count 9996)
99.976% <= 32.079 milliseconds (cumulative count 9998)
99.988% <= 32.863 milliseconds (cumulative count 9999)
99.994% <= 33.663 milliseconds (cumulative count 10000)
100.000% <= 33.663 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.010% <= 4.103 milliseconds (cumulative count 1)
0.060% <= 5.103 milliseconds (cumulative count 6)
0.130% <= 6.103 milliseconds (cumulative count 13)
0.710% <= 7.103 milliseconds (cumulative count 71)
2.280% <= 8.103 milliseconds (cumulative count 228)
7.360% <= 9.103 milliseconds (cumulative count 736)
21.580% <= 10.103 milliseconds (cumulative count 2158)
48.120% <= 11.103 milliseconds (cumulative count 4812)
78.370% <= 12.103 milliseconds (cumulative count 7837)
95.650% <= 13.103 milliseconds (cumulative count 9565)
99.110% <= 14.103 milliseconds (cumulative count 9911)
99.610% <= 15.103 milliseconds (cumulative count 9961)
99.750% <= 18.111 milliseconds (cumulative count 9975)
99.800% <= 19.103 milliseconds (cumulative count 9980)
99.900% <= 20.111 milliseconds (cumulative count 9990)
99.920% <= 27.103 milliseconds (cumulative count 9992)
99.930% <= 28.111 milliseconds (cumulative count 9993)
99.940% <= 29.103 milliseconds (cumulative count 9994)
99.950% <= 30.111 milliseconds (cumulative count 9995)
99.960% <= 31.103 milliseconds (cumulative count 9996)
99.980% <= 32.111 milliseconds (cumulative count 9998)
99.990% <= 33.119 milliseconds (cumulative count 9999)
100.000% <= 34.111 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 897.50 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       11.106     3.904    11.167    13.023    13.959    33.663
====== GET ======
  10000 requests completed in 11.31 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 2.831 milliseconds (cumulative count 1)
50.000% <= 11.567 milliseconds (cumulative count 5014)
75.000% <= 12.447 milliseconds (cumulative count 7524)
87.500% <= 13.055 milliseconds (cumulative count 8761)
93.750% <= 13.551 milliseconds (cumulative count 9386)
96.875% <= 14.007 milliseconds (cumulative count 9692)
98.438% <= 14.247 milliseconds (cumulative count 9852)
99.219% <= 14.703 milliseconds (cumulative count 9923)
99.609% <= 17.919 milliseconds (cumulative count 9961)
99.805% <= 18.863 milliseconds (cumulative count 9981)
99.902% <= 32.399 milliseconds (cumulative count 9991)
99.951% <= 36.319 milliseconds (cumulative count 9996)
99.976% <= 37.631 milliseconds (cumulative count 9998)
99.988% <= 38.143 milliseconds (cumulative count 9999)
99.994% <= 38.815 milliseconds (cumulative count 10000)
100.000% <= 38.815 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.020% <= 3.103 milliseconds (cumulative count 2)
0.090% <= 4.103 milliseconds (cumulative count 9)
0.410% <= 5.103 milliseconds (cumulative count 41)
1.420% <= 6.103 milliseconds (cumulative count 142)
5.160% <= 7.103 milliseconds (cumulative count 516)
8.280% <= 8.103 milliseconds (cumulative count 828)
12.220% <= 9.103 milliseconds (cumulative count 1222)
20.830% <= 10.103 milliseconds (cumulative count 2083)
38.430% <= 11.103 milliseconds (cumulative count 3843)
64.850% <= 12.103 milliseconds (cumulative count 6485)
88.760% <= 13.103 milliseconds (cumulative count 8876)
97.820% <= 14.103 milliseconds (cumulative count 9782)
99.420% <= 15.103 milliseconds (cumulative count 9942)
99.510% <= 17.103 milliseconds (cumulative count 9951)
99.610% <= 18.111 milliseconds (cumulative count 9961)
99.810% <= 19.103 milliseconds (cumulative count 9981)
99.900% <= 20.111 milliseconds (cumulative count 9990)
99.920% <= 33.119 milliseconds (cumulative count 9992)
99.930% <= 34.111 milliseconds (cumulative count 9993)
99.940% <= 35.103 milliseconds (cumulative count 9994)
99.950% <= 36.127 milliseconds (cumulative count 9995)
99.970% <= 37.119 milliseconds (cumulative count 9997)
99.980% <= 38.111 milliseconds (cumulative count 9998)
100.000% <= 39.103 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 884.49 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       11.254     2.824    11.567    13.687    14.583    38.815